#include <stdio.h>  // Η βιβλιοθήκη αυτή περιέχει την συνάρτηση printf
#include <stdlib.h> // Η βιβλιοθήκη αυτή περιέχει τις συναρτήσεις strtoll και llabs (απόλυτη τιμή μεγάλων ακεραίων)

// Συνάρτηση για τον υπολογισμό του GCD χρησιμοποιώντας τον Αλγόριθμο του Ευκλείδη
long long gcd(long long a, long long b) {
    if (b == 0)
        return a; // Αν το b είναι 0, τότε το GCD είναι το a
    return gcd(b, a % b); // Αναδρομικά καλούμε τη συνάρτηση για τα b και a % b
}

int main(int argc, char *argv[]) {
    // Ελέγχουμε αν υπάρχουν ακριβώς 3 παραμέτροι στην εκτέλεση του προγράμματος
    if (argc != 3) {
        printf("Usage: ./gcd <num1> <num2>\n"); // Εκτυπώνουμε μήνυμα για λάθος χρήση
        return 1; // Επιστρέφουμε 1 για λάθος χρήση
    }
    
    // Μετατρέπουμε τις παραμέτρους σε long long ακέραιους αριθμούς
    long long num1 = atoll(argv[1]);
    long long num2 = atoll(argv[2]);

    // Εκτυπώνουμε το αποτέλεσμα του GCD με τη χρήση της συνάρτησης gcd()
    // Χρησιμοποιούμε την llabs() για να εξασφαλίσουμε ότι οι αριθμοί είναι θετικοί
    printf("gcd(%lld, %lld) = %lld\n", num1, num2, gcd(llabs(num1), llabs(num2)));
    return 0; // Επιστρέφουμε 0 για επιτυχή εκτέλεση
}
